       01  REG-ARQCRM.
           05 ARQCRM-CHAVE      PIC 9(05).
           05 ARQCRM-NOME       PIC X(30).
           05 ARQCRM-SALDO      PIC 9(7)V99.
